In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [3]:
arr

array([10, 20, 30])

In [4]:
d

{'a': 10, 'b': 20, 'c': 30}

In [5]:

pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
from numpy.random import randn
np.random.seed(101)

In [8]:
df= pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [9]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [11]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [12]:
df >0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [13]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [16]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [17]:
df[(df['W']>0) & (df['Y']>1)][['Z','Y']]

          Z         Y
E  0.683509  2.605967

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [20]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [21]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [22]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [23]:
df['s']=['p','q','r','s','t']

In [24]:
df.set_index('s')

          W         X         Y         Z
s
p  2.706850  0.628133  0.907969  0.503826
q  0.651118 -0.319318 -0.848077  0.605965
r -2.018168  0.740122  0.528813 -0.589001
s  0.188695 -0.758872 -0.933237  0.955057
t  0.190794  1.978757  2.605967  0.683509

In [26]:
df

          W         X         Y         Z  s
A  2.706850  0.628133  0.907969  0.503826  p
B  0.651118 -0.319318 -0.848077  0.605965  q
C -2.018168  0.740122  0.528813 -0.589001  r
D  0.188695 -0.758872 -0.933237  0.955057  s
E  0.190794  1.978757  2.605967  0.683509  t

In [27]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [28]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [29]:
inside

[1, 2, 3, 1, 2, 3]

In [30]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [32]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [33]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [34]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [35]:
df=pd.DataFrame(d)

In [36]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [38]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [46]:
data={
    'compnay':['F','A','N','G','F','A','N','G'],
    'Person':['sam','joe','will','hoje','sam','jo','wil','hje'],
    'sales':[1,2,3,4,5,6,7,8]
}

In [47]:
df=pd.DataFrame(data)

In [48]:
df

  compnay Person  sales
0       F    sam      1
1       A    joe      2
2       N   will      3
3       G   hoje      4
4       F    sam      5
5       A     jo      6
6       N    wil      7
7       G    hje      8

In [51]:
df.groupby('compnay')